Tekla.Structures.ModelInternal.InputTypeEnum
The possible input types for input geometry objects.

Tekla.Structures.ModelInternal.InputTypeEnum.LINE
Line type.

Tekla.Structures.ModelInternal.InputTypeEnum.POLYLINE
PolyLine type.

Tekla.Structures.ModelInternal.InputTypeEnum.POLYGON
Polygon type.